### Step 1 - Removing Columns or Rows

Load the titanic.csv dataset to a dataframe and than print it.

In [ ]:
import pandas as pd
df = pd.read_csv('titanic.csv')
df.head(5)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

Remove the following columns from the dataframe: "SibSp", "Parch", "Ticket". Print the updated dataframe.

In [ ]:
df.drop(['SibSp', 'Parch', 'Ticket'], axis=1, inplace=True)
df.head(5)

,PassengerId,Survived,Pclass,Name,Sex,Age,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,8.0500,NaN,S

Remove the first 20 rows from the dataframe.Print the updated dataframe.

In [ ]:
df.drop(range(0,20), axis=0, inplace=True)
df.head(5)

,PassengerId,Survived,Pclass,Name,Sex,Age,Fare,Cabin,Embarked
20,21,0,2,"Fynney, Mr. Joseph J",male,35.0,26.0000,NaN,S
21,22,1,2,"Beesley, Mr. Lawrence",male,34.0,13.0000,D56,S
22,23,1,3,"McGowan, Miss. Anna ""Annie""",female,15.0,8.0292,NaN,Q
23,24,1,1,"Sloper, Mr. William Thompson",male,28.0,35.5000,A6,S
24,25,0,3,"Palsson, Miss. Torborg Danira",female,8.0,21.0750,NaN,S

### Step 2 - Removing Duplicate Rows

Reload the titanic.csv dataset to a dataframe and print the LAST five rows.

In [ ]:
import pandas as pd
df = pd.read_csv('titanic.csv')
df.tail(5)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.00,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.00,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.45,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.00,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.75,NaN,Q

Add five duplicated rows to the dataframe that are duplicated from the first row. And than add six duplicated rows to the dataframe that are duplicated from the second row (tip - use for-loop and the loc method with 891 offset).

In [ ]:
for i in range(5):
    df.loc[i+891, :]=df.loc[0, :]
for i in range(6):
    df.loc[i+896, :]=df.loc[1, :]

Print the last 15 rows.

In [ ]:
df.tail(15)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
887,888.0,1.0,1.0,"Graham, Miss. Margaret Edith",female,19.0,0.0,0.0,112053,30.0000,B42,S
888,889.0,0.0,3.0,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1.0,2.0,W./C. 6607,23.4500,NaN,S
889,890.0,1.0,1.0,"Behr, Mr. Karl Howell",male,26.0,0.0,0.0,111369,30.0000,C148,C
890,891.0,0.0,3.0,"Dooley, Mr. Patrick",male,32.0,0.0,0.0,370376,7.7500,NaN,Q
891,1.0,0.0,3.0,"Braund, Mr. Owen Harris",male,22.0,1.0,0.0,A/5 21171,7.2500,NaN,S
892,1.0,0.0,3.0,"Braund, Mr. Owen Harris",male,22.0,1.0,0.0,A/5 21171,7.2500,NaN,S
893,1.0,0.0,3.0,"Braund, Mr. Owen Harris",male,22.0,1.0,0.0,A/5 21171,7.2500,NaN,S
894,1.0,0.0,3.0,"Braund, Mr. Owen Harris",male,22.0,1.0,0.0,A/5 21171,7.2500,NaN,S
895,1.0,0.0,3.0,"Braund, Mr. Owen Harris",male,22.0,1.0,0.0,A/5 21171,7.2500,NaN,S
896,2.0,1.0,1.0,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1.0,0.0,PC 17599,71.2833,C85,C
897,2.0,1.0,1.0,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1.0,0.0,PC 17599,71.2833,C85,C
898,2.0,1.0,1.0,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1.0,0.0,PC 17599,71.2833,C85,C
899,2.0,1.0,1.0,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1.0,0.0,PC 17599,71.2833,C85,C
900,2.0,1.0,1.0,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1.0,0.0,PC 17599,71.2833,C85,C
901,2.0,1.0,1.0,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1.0,0.0,PC 17599,71.2833,C85,C

Print the amount of duplicated rows in the dataframe (it should be 11).

In [ ]:
df.duplicated().sum()

11

Print the duplicated rows using the loc method combined with the duplicated method.

In [ ]:
df.loc[df.duplicated(), :]

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
891,1.0,0.0,3.0,"Braund, Mr. Owen Harris",male,22.0,1.0,0.0,A/5 21171,7.2500,NaN,S
892,1.0,0.0,3.0,"Braund, Mr. Owen Harris",male,22.0,1.0,0.0,A/5 21171,7.2500,NaN,S
893,1.0,0.0,3.0,"Braund, Mr. Owen Harris",male,22.0,1.0,0.0,A/5 21171,7.2500,NaN,S
894,1.0,0.0,3.0,"Braund, Mr. Owen Harris",male,22.0,1.0,0.0,A/5 21171,7.2500,NaN,S
895,1.0,0.0,3.0,"Braund, Mr. Owen Harris",male,22.0,1.0,0.0,A/5 21171,7.2500,NaN,S
896,2.0,1.0,1.0,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1.0,0.0,PC 17599,71.2833,C85,C
897,2.0,1.0,1.0,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1.0,0.0,PC 17599,71.2833,C85,C
898,2.0,1.0,1.0,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1.0,0.0,PC 17599,71.2833,C85,C
899,2.0,1.0,1.0,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1.0,0.0,PC 17599,71.2833,C85,C
900,2.0,1.0,1.0,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1.0,0.0,PC 17599,71.2833,C85,C
901,2.0,1.0,1.0,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1.0,0.0,PC 17599,71.2833,C85,C

Print the shape of the dataframe (should be 902,12).

In [ ]:
df.shape

(902, 12)

Drop all duplicated lines while keeping the first occurnace of duplicated row and save the changes in the dataframe. Print the shape attribute (should be back to 891,12).

In [ ]:
df.drop_duplicates(keep='first', inplace=True)
df.shape

(891, 12)

### Step 3 - Renaming Column Labels

Reload the titanic.csv dataset to a dataframe.

In [ ]:
import pandas as pd
df = pd.read_csv('titanic.csv')
df.head(5)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

Print the columns labels attribute.

In [ ]:
df.columns

Index(['PassengerId', 'Survived', 'Pclass', 'Name', 'Sex', 'Age', 'SibSp',
       'Parch', 'Ticket', 'Fare', 'Cabin', 'Embarked'],
      dtype='object')

Rename the following column labels: 'Name' into 'Full_Name', 'Fare':'Ticket_Price'.

In [ ]:
df.rename(columns = {'Name':'Full_Name', 'Fare':'Ticket_Price'}, inplace=True)

Print the updated columns labels attribute.

In [ ]:
df.columns

Index(['PassengerId', 'Survived', 'Pclass', 'Full_Name', 'Sex', 'Age', 'SibSp',
       'Parch', 'Ticket', 'Ticket_Price', 'Cabin', 'Embarked'],
      dtype='object')

Remove all columns labels to the following new labels: ['C1', 'C2','C3','C4','C5','C6','C7','C8','C9','C10','C11','C12']

In [ ]:
new_col = ['C1', 'C2','C3','C4','C5','C6','C7','C8','C9','C10','C11','C12']
df.columns = new_col[:]

Print the updated columns labels attribute.

In [ ]:
df.columns

Index(['C1', 'C2', 'C3', 'C4', 'C5', 'C6', 'C7', 'C8', 'C9', 'C10', 'C11',
       'C12'],
      dtype='object')

### Step 4 - Dropping Missing Values

Reload the titanic.csv dataset to a dataframe.

In [ ]:
import pandas as pd
df = pd.read_csv('titanic.csv')
df.head(5)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

Check the number of missing values per each column.

In [ ]:
df.isnull().sum()

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age            177
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin          687
Embarked         2
dtype: int64

The "Cabin" columns has many missing data rows so let's remove thise column from the dataset. Print again the number of missing values per each column.

In [ ]:
df.drop(['Cabin'], axis=1, inplace=True)
df.isnull().sum()

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age            177
SibSp            0
Parch            0
Ticket           0
Fare             0
Embarked         2
dtype: int64

Drop all rows with missing values.

In [ ]:
df.dropna(inplace=True)
df.isnull().sum()

PassengerId    0
Survived       0
Pclass         0
Name           0
Sex            0
Age            0
SibSp          0
Parch          0
Ticket         0
Fare           0
Embarked       0
dtype: int64

### Step 5 - Filling-in Missing Values

Reload the titanic.csv dataset to a dataframe.

In [ ]:
import pandas as pd
df = pd.read_csv('titanic.csv')
df.head(5)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

Fill all missing values in the "Age" column with the average age.

In [ ]:
df['Age'].fillna(df['Age'].mean(), inplace=True)

Print the amount of missing values in each column.

In [ ]:
df.isnull().sum()

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age              0
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin          687
Embarked         2
dtype: int64

How many rows we have for each value in the 'Embarked' column including the missing values? (should be 2).

In [ ]:
df['Embarked'].value_counts(dropna=False)

S      644
C      168
Q       77
NaN      2
Name: Embarked, dtype: int64

Fill the missing values in the 'Embarked' column and also 'Cabin" column with the text value "missing".

In [ ]:
df['Embarked'].fillna(value='missing', inplace=True)
df['Cabin'].fillna(value='missing', inplace=True)
df.isnull().sum()

PassengerId    0
Survived       0
Pclass         0
Name           0
Sex            0
Age            0
SibSp          0
Parch          0
Ticket         0
Fare           0
Cabin          0
Embarked       0
dtype: int64

Print the dataframe.

In [ ]:
df.head(5)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,missing,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,missing,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,missing,S

### Step 6 - Creating Dummy Variables

Reload the titanic.csv dataset to a dataframe.

In [ ]:
import pandas as pd
df = pd.read_csv('titanic.csv')
df.head(5)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

Remove the following columns: 'Pclass', 'SibSp', 'Parch', 'Ticket', 'Cabin' from the dataframe. Print the updated dataframe.

In [ ]:
df.drop(['Pclass', 'SibSp', 'Parch', 'Ticket', 'Cabin'], axis=1, inplace=True)
df.head(5)

,PassengerId,Survived,Name,Sex,Age,Fare,Embarked
0,1,0,"Braund, Mr. Owen Harris",male,22.0,7.2500,S
1,2,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,71.2833,C
2,3,1,"Heikkinen, Miss. Laina",female,26.0,7.9250,S
3,4,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,53.1000,S
4,5,0,"Allen, Mr. William Henry",male,35.0,8.0500,S

Drop rows with missing values in the 'Embarked' column.

In [ ]:
df.dropna(subset=['Embarked'], inplace=True)

Print the unique values we have in the 'Embarked' column (should be 'S', 'C', 'Q').

In [ ]:
df['Embarked'].unique()

array(['S', 'C', 'Q'], dtype=object)

Create dummy variables for the 'Embarked' column using the get_dummies function (it is not a method of dataframe). The 'Embarked' column as 3 possible values for this categorical feature, so we are expecting to get 2 dummy variables (tip - use the drop_first argument).

In [ ]:
df=pd.get_dummies(df, columns=['Embarked'], drop_first=True)

Print the updated dataframe.

In [ ]:
df.head(10)

,PassengerId,Survived,Name,Sex,Age,Fare,Embarked_Q,Embarked_S
0,1,0,"Braund, Mr. Owen Harris",male,22.0,7.2500,0,1
1,2,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,71.2833,0,0
2,3,1,"Heikkinen, Miss. Laina",female,26.0,7.9250,0,1
3,4,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,53.1000,0,1
4,5,0,"Allen, Mr. William Henry",male,35.0,8.0500,0,1
5,6,0,"Moran, Mr. James",male,NaN,8.4583,1,0
6,7,0,"McCarthy, Mr. Timothy J",male,54.0,51.8625,0,1
7,8,0,"Palsson, Master. Gosta Leonard",male,2.0,21.0750,0,1
8,9,1,"Johnson, Mrs. Oscar W (Elisabeth Vilhelmina Berg)",female,27.0,11.1333,0,1
9,10,1,"Nasser, Mrs. Nicholas (Adele Achem)",female,14.0,30.0708,0,0

### Step 7 - Exporting Pandas DataFrames

We may want to save the cleaned and transformed new dataframe back to a CSV file so we will be able to use it as an input data into the next step in our project.

Save the df dataframe into a file called "output.csv" inside your working directory, without using the index row numbers in the output file.

In [ ]:
df.to_csv('output.csv', index=False)